[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
0
1
2
3
—
“
”
…
、
。
一
七
万
三
上
下
不
与
且
世
业
东
丝
两
严
个
中
临
丹
为
主
举
乃
久
么
义
之
乎
九
也
习
书
乱
了
争
事
二
于
云
五
些
亡
交
亮
亲
人
亿
什
仅
今
仍
从
他
仙
代
令
以
们
件
任
份
仿
众
伙
会
传
伤
似
但
位
低
住
体
何
余
佛
作
你
使
依
便
保
信
修
倒
候
做
停
催
像
儿
元
兄
充
先
光
克
入
全
八
公
六
关
兴
兵
其
具
兽
内
再
军
冥
冰
冲
决
况
冷
准
凌
凝
几
凡
凤
凭
凰
凶
出
击
刀
分
切
则
刚
创
初
利
别
到
制
刻
前
剑
剩
力
办
功
加
务
动
助
劫
势
包
化
北
区
十
千
升
半
华
单
南
卫
印
危
即
却
卷
历
厉
压
原
去
参
又
及
友
双
反
发
取
受
变
口
古
句
另
只
叫
可
台
右
叶
号
叹
吃
各
合
同
名
后
向
吓
吗
君
吞
吟
否
吧
听
启
吸
吼
呆
告
呢
周
味
呵
呼
命
和
品
哈
响
哥
哪
哼
唯
商
啊
喜
喝
嘴
嘿
器
噬
四
回
因
团
围
固
国
图
圆
土
圣
在
地
场
坐
块
坚
城
域
基
堂
堪
塔
境
增
墨
士
声
处
备
复
外
多
夜
够
大
天
太
夫
失
头
夺
奇
女
她
好
如
妈
妖
妹
始
姐
威
子
字
存
孙
学
孩
宁
它
宇
守
安
完
宗
宙
定
宛
宝
实
客
室
宫
宰
害
家
容
寂
密
寒
察
对
寻
封
射
将
尊
小
少
尔
尘
就
尸
尽
层
居
展
属
山
岛
峰
崩
巅
州
左
巨
差
己
已
巴
布
师
希
帝
带
席
帮
常
幕
干
平
年
并
幸
幻
幽
广
应
底
府
庞
废
度
座
建
开
异
式
引
弟
张
弥
弱
强
归
当
形
彩
影
彻
往
待
很
得
御
微
德
心
必
忍
志
忙
快
念
忽
态
怎
怒
怔
怕
怖
思
急
性
怪
总
恐
恒
恢
恩
恭
息
恶
悟
情
惊
惑
惜
惧
惨
想
意
感
愣
愿
慢
成
我
或
战
所
手
才
打
执
扫
找
承
技
把
抓
抗
护
报
抬
抵
担
拉
拍
招
拜
拥
拳
拿
持
指
按
挑
挡
挥
据
掉
掌
排
探
接
控
推
提
握
摆
摇
撞
收
攻
放
效
敌
救
教
敢
散
敬
数
整
文
斗
料
斩
断
斯
新
方
施
旁
族
无
既
日
旦
早
时
明
易
星
是
显
晋
普
景
晶
智
暗
暴
更
曾
最
月
有
服
望
朝
期
木
未
本
术
朱
机
朽
杀
李
条
来
杨
杰
松
极
林
枚
果
查
树
样
核
根
格
森
楚
楼
模
横
次
欧
止
正
此
步
武
死
残
段
殿
毁
每
毒
比
毕
毫
气
水
永
求
江
池
沉
沌
没
河
法
波
注
洞
活
派
流
测
浑
浩
浪
浮
海
消
涌
淡
深
混
清
渐
温
游
源
滚
满
漠
漫
激
火
灭
灰
灵
炎
炸
点
炼
烁
烈
热
焰
然
照
爆
父
片
牙
牛
物
特
状
狂
狠
独
狱
猛
猜
猫
玄
玉
王
玩
现
球
理
瑶
甚
生
用
由
甲
电
男
界
留
疑
疯
痛
登
白
百
的
皆
皇
皱
盖
盘
盟
目
盯
直
相
眉
看
真
眸
眼
着
睁
睛
瞪
瞬
知
短
石
破
确
碎
礼
祖
神
禁
离
种
秘
称
程
究
穹
空
穿
突
立
站
竟
章
笑
符
第
笼
等
答
简
算
管
米
类
精
系
紧
紫
红
约
级
纪
纯
纷
线
练
细
终
经
结
给
绝
统
继
续
维
绿
缓
缘
罗
罢
罩
罪
置
美
群
翻
翼
耀
老
考
者
而
联
聚
肉
股
肯
背
胜
能
脉
脑
脚
脸
腾
自
至
致
般
船
色
芒
花
苍
苏
若
苦
荒
荡
药
莫
莲
落
蒙
蓝
蕴
藏
虎
虚
虽
蛋
融
血
行
衣
表
袋
袍
被
裂
装
西
要
见
观
规
视
觉
角
解
言
计
认
让
议
记
许
论
识
试
话
该
语
说
请
诸
谁
谢
谷
象
贝
负
败
质
贱
贵
费
资
赋
赛
赤
走
赵
赶
起
超
越
足
跑
距
跟
路
跳
踏
身
躯
车
转
轮
轰
轻
辈
辉
辰
边
达
过
迎
运
近
还
这
进
远
连
迟
迹
追
退
送
逃
选
透
通
速
造
逸
逼
遇
遍
道
那
邪
部
都
酒
醒
释
里
重
野
量
金
钟
铁
铮
银
错
镇
长
门
闪
闭
问
间
闻
阁
队
防
阳
阴
阵
阶
际
陆
陈
降
限
院
除
险
隆
随
隐
难
雪
雷
需
霄
震
露
霸
青
静
非
靠
面
韩
音
顶
须
顾
顿
领
颗
题
颤
风
飞
首
马
骇
骚
骨
高
鬼
魂
魔
鸿
麻
黄
黑
默
齐
龙
！
，
：
？
##0
##2
##1
##3
10
12
11
20
13
21
22
##00
23
30
31
32
33
01
02
03
00
100
101
200
103
110
120
112
123
201
102
121
111
131
122
113
132
130
133
300
##01
202
211
203
212
213
223
##02
1000
222
221
210
##32
220
##20
##13
##23
301
##22
##11
##12
##21
##30
230
000
##10
##33
##03
##31
231
232
233
313
322
323
310
333
001
302
303
312
311
320
321
330
332
331
010
012
011
013
020
022
021
023
030
032
031
033
002
003
1200
##000
2000
10000
3000
##0000
1011
1102
1300
1001
1231
1100
2200
2300
1012
1030
1031
1123
1022
1023
1212
1320
1330
1331
2100
1002
1003
1010
1013
2001
1032
1033
1101
1103
1202
1201
1203
1120
1122
1121
1230
1232
1233
2010
2012
1020
1021
1210
1211
1213
1110
1112
1111
1113
1310
1312
1311
1313
1220
1222
1221
1223
1130
1132
1131
1133
1322
1321
1323
1302
1301
1303
1332
1333
##012
##322
1011322
##1000
2101
2102
2201
2202
2311
3321
3333
0113
2002
2003
2011
2013
2020
2022
2021
2023
2110
2112
2111
2113
2030
2032
2031
2033
2120
2122
2121
2123
2130
2132
2131
2133
2230
2232
2231
2233
2220
2222
2221
2223
2210
2212
2211
2213
2103
2203
##222
##000000
##032
##201
##100
##330
##001
##0001
##0013
2301
2302
2332
2320
2313
2323
2322
2312
2321
2330
2310
2333
2331
3032
3020
3013
3023
3022
3021
3030
3033
3031
3100
3101
3102
3132
3120
3113
3123
3122
3111
3112
3121
3130
3110
3133
3103
3131
3200
3201
3202
3232
3220
3213
3223
3222
3211
3212
3221
3230
3210
3233
3203
3231
3300
3301
3302
3332
3320
3313
3323
3322
3311
3312
3330
3310
3303
3331
0100
0101
0102
0132
0120
0123
0122
0111
0112
0121
0130
0110
0133
0103
0131
0200
0201
0202
0232
0220
0213
0223
0222
0211
0212
0221
0230
0210
0233
0203
0231
0300
0301
0302
0332
0320
0313
0323
0322
0311
0312
0321
0330
0310
0333
0303
0331
0032
0020
0013
0023
0022
0011
0012
0021
0030
0010
0033
0031
10032
12012
13232
3002
3001
3003
3000013
1000000
10000001
##321
##233
##23321
3010
3012
3011
##21012
2303
0000
0002
0001
0003
##00002
##000001
1031222
1003203
12012001
300001300002
